"" + 1 + 0  // 10    Сначала "" + 1 = "1", затем "1" + 0 = "10"
"" - 1 + 0 // -1  "" приводится к 0 0 - 1 = -1, -1 + 0 = -1
true + false // 1 0+1 = 1
6 / "3" // 2
"2" * "3" // 6
4 + 5 + "px"  //'9px'
"$" + 4 + 5 // $45 строка + число = строка, слева направо
"4" - 2 // 2
"4px" - 2 // NaN 	"4px" нельзя преобразовать в число
"  -9  " + 5 // "-9 5" строка + число
"  -9  " - 5 // -14
null + 1 // 1 null → 0, 0 + 1 = 1
undefined + 1 // NaN undefined → NaN, NaN + 1 = NaN
" \t \n" - 2 // -2 Пробельные символы, такие как \t и \n, игнорируются при преобразовании в число